zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_SIUL2.h
#define SIUL2_DISR0_EIF7_MASK                    (0x80U)
#define SIUL2_DISR0_EIF7_SHIFT                   (7U)
/*! EIF7 - External Interrupt Status Flag 7
 *  0b0..No interrupt event has occurred on the pad.
 *  0b1..An interrupt event as defined by IREER7 and IFEER7 has occurred.
 */
#define SIUL2_DISR0_EIF7(x)                      (((uint32_t)(((uint32_t)(x)) << SIUL2_DISR0_EIF7_SHIFT)) & SIUL2_DISR0_EIF7_MASK)

#define SIUL2_DISR0_EIF8_MASK                    (0x100U)
#define SIUL2_DISR0_EIF8_SHIFT                   (8U)
/*! EIF8 - External Interrupt Status Flag 8
 *  0b0..No interrupt event has occurred on the pad.
 *  0b1..An interrupt event as defined by IREER8 and IFEER8 has occurred.
 */
#define SIUL2_DISR0_EIF8(x)                      (((uint32_t)(((uint32_t)(x)) << SIUL2_DISR0_EIF8_SHIFT)) & SIUL2_DISR0_EIF8_MASK)

#define SIUL2_DISR0_EIF9_MASK                    (0x200U)
#define SIUL2_DISR0_EIF9_SHIFT                   (9U)
/*! EIF9 - External Interrupt Status Flag 9
 *  0b0..No interrupt event has occurred on the pad.
 *  0b1..An interrupt event as defined by IREER9 and IFEER9 has occurred.
 */
#define SIUL2_DISR0_EIF9(x)                      (((uint32_t)(((uint32_t)(x)) << SIUL2_DISR0_EIF9_SHIFT)) & SIUL2_DISR0_EIF9_MASK)

#define SIUL2_DISR0_EIF10_MASK                   (0x400U)
#define SIUL2_DISR0_EIF10_SHIFT                  (10U)
/*! EIF10 - External Interrupt Status Flag 10
 *  0b0..No interrupt event has occurred on the pad.
 *  0b1..An interrupt event as defined by IREER10 and IFEER10 has occurred.
 */
#define SIUL2_DISR0_EIF10(x)                     (((uint32_t)(((uint32_t)(x)) << SIUL2_DISR0_EIF10_SHIFT)) & SIUL2_DISR0_EIF10_MASK)

#define SIUL2_DISR0_EIF11_MASK                   (0x800U)
#define SIUL2_DISR0_EIF11_SHIFT                  (11U)
/*! EIF11 - External Interrupt Status Flag 11
 *  0b0..No interrupt event has occurred on the pad.
 *  0b1..An interrupt event as defined by IREER11 and IFEER11 has occurred.
 */
#define SIUL2_DISR0_EIF11(x)                     (((uint32_t)(((uint32_t)(x)) << SIUL2_DISR0_EIF11_SHIFT)) & SIUL2_DISR0_EIF11_MASK)

#define SIUL2_DISR0_EIF12_MASK                   (0x1000U)
#define SIUL2_DISR0_EIF12_SHIFT                  (12U)
/*! EIF12 - External Interrupt Status Flag 12
 *  0b0..No interrupt event has occurred on the pad.
 *  0b1..An interrupt event as defined by IREER12 and IFEER12 has occurred.
 */
#define SIUL2_DISR0_EIF12(x)                     (((uint32_t)(((uint32_t)(x)) << SIUL2_DISR0_EIF12_SHIFT)) & SIUL2_DISR0_EIF12_MASK)

#define SIUL2_DISR0_EIF13_MASK                   (0x2000U)
#define SIUL2_DISR0_EIF13_SHIFT                  (13U)
/*! EIF13 - External Interrupt Status Flag 13
 *  0b0..No interrupt event has occurred on the pad.
 *  0b1..An interrupt event as defined by IREER13 and IFEER13 has occurred.
 */
#define SIUL2_DISR0_EIF13(x)                     (((uint32_t)(((uint32_t)(x)) << SIUL2_DISR0_EIF13_SHIFT)) & SIUL2_DISR0_EIF13_MASK)

#define SIUL2_DISR0_EIF14_MASK                   (0x4000U)
#define SIUL2_DISR0_EIF14_SHIFT                  (14U)
/*! EIF14 - External Interrupt Status Flag 14
 *  0b0..No interrupt event has occurred on the pad.
 *  0b1..An interrupt event as defined by IREER14 and IFEER14 has occurred.
 */
#define SIUL2_DISR0_EIF14(x)                     (((uint32_t)(((uint32_t)(x)) << SIUL2_DISR0_EIF14_SHIFT)) & SIUL2_DISR0_EIF14_MASK)

#define SIUL2_DISR0_EIF15_MASK                   (0x8000U)
#define SIUL2_DISR0_EIF15_SHIFT                  (15U)
/*! EIF15 - External Interrupt Status Flag 15
 *  0b0..No interrupt event has occurred on the pad.
 *  0b1..An interrupt event as defined by IREER15 and IFEER15 has occurred.
 */
#define SIUL2_DISR0_EIF15(x)                     (((uint32_t)(((uint32_t)(x)) << SIUL2_DISR0_EIF15_SHIFT)) & SIUL2_DISR0_EIF15_MASK)

#define SIUL2_DISR0_EIF16_MASK                   (0x10000U)
#define SIUL2_DISR0_EIF16_SHIFT                  (16U)
/*! EIF16 - External Interrupt Status Flag 16
 *  0b0..No interrupt event has occurred on the pad.
 *  0b1..An interrupt event as defined by IREER16 and IFEER16 has occurred.
 */
#define SIUL2_DISR0_EIF16(x)                     (((uint32_t)(((uint32_t)(x)) << SIUL2_DISR0_EIF16_SHIFT)) & SIUL2_DISR0_EIF16_MASK)

#define SIUL2_DISR0_EIF17_MASK                   (0x20000U)
#define SIUL2_DISR0_EIF17_SHIFT                  (17U)
/*! EIF17 - External Interrupt Status Flag 17
 *  0b0..No interrupt event has occurred on the pad.
 *  0b1..An interrupt event as defined by IREER17 and IFEER17 has occurred.
 */
#define SIUL2_DISR0_EIF17(x)                     (((uint32_t)(((uint32_t)(x)) << SIUL2_DISR0_EIF17_SHIFT)) & SIUL2_DISR0_EIF17_MASK)

#define SIUL2_DISR0_EIF18_MASK                   (0x40000U)
#define SIUL2_DISR0_EIF18_SHIFT                  (18U)
/*! EIF18 - External Interrupt Status Flag 18
 *  0b0..No interrupt event has occurred on the pad.
 *  0b1..An interrupt event as defined by IREER18 and IFEER18 has occurred.
 */
#define SIUL2_DISR0_EIF18(x)                     (((uint32_t)(((uint32_t)(x)) << SIUL2_DISR0_EIF18_SHIFT)) & SIUL2_DISR0_EIF18_MASK)

#define SIUL2_DISR0_EIF19_MASK                   (0x80000U)
#define SIUL2_DISR0_EIF19_SHIFT                  (19U)
/*! EIF19 - External Interrupt Status Flag 19
 *  0b0..No interrupt event has occurred on the pad.
 *  0b1..An interrupt event as defined by IREER19 and IFEER19 has occurred.
 */
#define SIUL2_DISR0_EIF19(x)                     (((uint32_t)(((uint32_t)(x)) << SIUL2_DISR0_EIF19_SHIFT)) & SIUL2_DISR0_EIF19_MASK)

#define SIUL2_DISR0_EIF20_MASK                   (0x100000U)
#define SIUL2_DISR0_EIF20_SHIFT                  (20U)
/*! EIF20 - External Interrupt Status Flag 20
 *  0b0..No interrupt event has occurred on the pad.
 *  0b1..An interrupt event as defined by IREER20 and IFEER20 has occurred.
 */
#define SIUL2_DISR0_EIF20(x)                     (((uint32_t)(((uint32_t)(x)) << SIUL2_DISR0_EIF20_SHIFT)) & SIUL2_DISR0_EIF20_MASK)

#define SIUL2_DISR0_EIF21_MASK                   (0x200000U)
#define SIUL2_DISR0_EIF21_SHIFT                  (21U)
/*! EIF21 - External Interrupt Status Flag 21
 *  0b0..No interrupt event has occurred on the pad.
 *  0b1..An interrupt event as defined by IREER21 and IFEER21 has occurred.
 */
#define SIUL2_DISR0_EIF21(x)                     (((uint32_t)(((uint32_t)(x)) << SIUL2_DISR0_EIF21_SHIFT)) & SIUL2_DISR0_EIF21_MASK)

