zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_SIUL2.h
#define SIUL2_DISR0_EIF22_MASK                   (0x400000U)
#define SIUL2_DISR0_EIF22_SHIFT                  (22U)
/*! EIF22 - External Interrupt Status Flag 22
 *  0b0..No interrupt event has occurred on the pad.
 *  0b1..An interrupt event as defined by IREER22 and IFEER22 has occurred.
 */
#define SIUL2_DISR0_EIF22(x)                     (((uint32_t)(((uint32_t)(x)) << SIUL2_DISR0_EIF22_SHIFT)) & SIUL2_DISR0_EIF22_MASK)

#define SIUL2_DISR0_EIF23_MASK                   (0x800000U)
#define SIUL2_DISR0_EIF23_SHIFT                  (23U)
/*! EIF23 - External Interrupt Status Flag 23
 *  0b0..No interrupt event has occurred on the pad.
 *  0b1..An interrupt event as defined by IREER23 and IFEER23 has occurred.
 */
#define SIUL2_DISR0_EIF23(x)                     (((uint32_t)(((uint32_t)(x)) << SIUL2_DISR0_EIF23_SHIFT)) & SIUL2_DISR0_EIF23_MASK)

#define SIUL2_DISR0_EIF24_MASK                   (0x1000000U)
#define SIUL2_DISR0_EIF24_SHIFT                  (24U)
/*! EIF24 - External Interrupt Status Flag 24
 *  0b0..No interrupt event has occurred on the pad.
 *  0b1..An interrupt event as defined by IREER24 and IFEER24 has occurred.
 */
#define SIUL2_DISR0_EIF24(x)                     (((uint32_t)(((uint32_t)(x)) << SIUL2_DISR0_EIF24_SHIFT)) & SIUL2_DISR0_EIF24_MASK)

#define SIUL2_DISR0_EIF25_MASK                   (0x2000000U)
#define SIUL2_DISR0_EIF25_SHIFT                  (25U)
/*! EIF25 - External Interrupt Status Flag 25
 *  0b0..No interrupt event has occurred on the pad.
 *  0b1..An interrupt event as defined by IREER25 and IFEER25 has occurred.
 */
#define SIUL2_DISR0_EIF25(x)                     (((uint32_t)(((uint32_t)(x)) << SIUL2_DISR0_EIF25_SHIFT)) & SIUL2_DISR0_EIF25_MASK)

#define SIUL2_DISR0_EIF26_MASK                   (0x4000000U)
#define SIUL2_DISR0_EIF26_SHIFT                  (26U)
/*! EIF26 - External Interrupt Status Flag 26
 *  0b0..No interrupt event has occurred on the pad.
 *  0b1..An interrupt event as defined by IREER26 and IFEER26 has occurred.
 */
#define SIUL2_DISR0_EIF26(x)                     (((uint32_t)(((uint32_t)(x)) << SIUL2_DISR0_EIF26_SHIFT)) & SIUL2_DISR0_EIF26_MASK)

#define SIUL2_DISR0_EIF27_MASK                   (0x8000000U)
#define SIUL2_DISR0_EIF27_SHIFT                  (27U)
/*! EIF27 - External Interrupt Status Flag 27
 *  0b0..No interrupt event has occurred on the pad.
 *  0b1..An interrupt event as defined by IREER27 and IFEER27 has occurred.
 */
#define SIUL2_DISR0_EIF27(x)                     (((uint32_t)(((uint32_t)(x)) << SIUL2_DISR0_EIF27_SHIFT)) & SIUL2_DISR0_EIF27_MASK)

#define SIUL2_DISR0_EIF28_MASK                   (0x10000000U)
#define SIUL2_DISR0_EIF28_SHIFT                  (28U)
/*! EIF28 - External Interrupt Status Flag 28
 *  0b0..No interrupt event has occurred on the pad.
 *  0b1..An interrupt event as defined by IREER28 and IFEER28 has occurred.
 */
#define SIUL2_DISR0_EIF28(x)                     (((uint32_t)(((uint32_t)(x)) << SIUL2_DISR0_EIF28_SHIFT)) & SIUL2_DISR0_EIF28_MASK)

#define SIUL2_DISR0_EIF29_MASK                   (0x20000000U)
#define SIUL2_DISR0_EIF29_SHIFT                  (29U)
/*! EIF29 - External Interrupt Status Flag 29
 *  0b0..No interrupt event has occurred on the pad.
 *  0b1..An interrupt event as defined by IREER29 and IFEER29 has occurred.
 */
#define SIUL2_DISR0_EIF29(x)                     (((uint32_t)(((uint32_t)(x)) << SIUL2_DISR0_EIF29_SHIFT)) & SIUL2_DISR0_EIF29_MASK)

#define SIUL2_DISR0_EIF30_MASK                   (0x40000000U)
#define SIUL2_DISR0_EIF30_SHIFT                  (30U)
/*! EIF30 - External Interrupt Status Flag 30
 *  0b0..No interrupt event has occurred on the pad.
 *  0b1..An interrupt event as defined by IREER30 and IFEER30 has occurred.
 */
#define SIUL2_DISR0_EIF30(x)                     (((uint32_t)(((uint32_t)(x)) << SIUL2_DISR0_EIF30_SHIFT)) & SIUL2_DISR0_EIF30_MASK)

#define SIUL2_DISR0_EIF31_MASK                   (0x80000000U)
#define SIUL2_DISR0_EIF31_SHIFT                  (31U)
/*! EIF31 - External Interrupt Status Flag 31
 *  0b0..No interrupt event has occurred on the pad.
 *  0b1..An interrupt event as defined by IREER31 and IFEER31 has occurred.
 */
#define SIUL2_DISR0_EIF31(x)                     (((uint32_t)(((uint32_t)(x)) << SIUL2_DISR0_EIF31_SHIFT)) & SIUL2_DISR0_EIF31_MASK)
/*! @} */

/*! @name DIRER0 - SIUL2 DMA/Interrupt Request Enable Register0 */
/*! @{ */

#define SIUL2_DIRER0_EIRE0_MASK                  (0x1U)
#define SIUL2_DIRER0_EIRE0_SHIFT                 (0U)
/*! EIRE0 - External Interrupt Request Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define SIUL2_DIRER0_EIRE0(x)                    (((uint32_t)(((uint32_t)(x)) << SIUL2_DIRER0_EIRE0_SHIFT)) & SIUL2_DIRER0_EIRE0_MASK)

#define SIUL2_DIRER0_EIRE1_MASK                  (0x2U)
#define SIUL2_DIRER0_EIRE1_SHIFT                 (1U)
/*! EIRE1 - External Interrupt Request Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define SIUL2_DIRER0_EIRE1(x)                    (((uint32_t)(((uint32_t)(x)) << SIUL2_DIRER0_EIRE1_SHIFT)) & SIUL2_DIRER0_EIRE1_MASK)

#define SIUL2_DIRER0_EIRE2_MASK                  (0x4U)
#define SIUL2_DIRER0_EIRE2_SHIFT                 (2U)
/*! EIRE2 - External Interrupt Request Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define SIUL2_DIRER0_EIRE2(x)                    (((uint32_t)(((uint32_t)(x)) << SIUL2_DIRER0_EIRE2_SHIFT)) & SIUL2_DIRER0_EIRE2_MASK)

#define SIUL2_DIRER0_EIRE3_MASK                  (0x8U)
#define SIUL2_DIRER0_EIRE3_SHIFT                 (3U)
/*! EIRE3 - External Interrupt Request Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define SIUL2_DIRER0_EIRE3(x)                    (((uint32_t)(((uint32_t)(x)) << SIUL2_DIRER0_EIRE3_SHIFT)) & SIUL2_DIRER0_EIRE3_MASK)

#define SIUL2_DIRER0_EIRE4_MASK                  (0x10U)
#define SIUL2_DIRER0_EIRE4_SHIFT                 (4U)
/*! EIRE4 - External Interrupt Request Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define SIUL2_DIRER0_EIRE4(x)                    (((uint32_t)(((uint32_t)(x)) << SIUL2_DIRER0_EIRE4_SHIFT)) & SIUL2_DIRER0_EIRE4_MASK)

#define SIUL2_DIRER0_EIRE5_MASK                  (0x20U)
#define SIUL2_DIRER0_EIRE5_SHIFT                 (5U)
/*! EIRE5 - External Interrupt Request Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define SIUL2_DIRER0_EIRE5(x)                    (((uint32_t)(((uint32_t)(x)) << SIUL2_DIRER0_EIRE5_SHIFT)) & SIUL2_DIRER0_EIRE5_MASK)

#define SIUL2_DIRER0_EIRE6_MASK                  (0x40U)
#define SIUL2_DIRER0_EIRE6_SHIFT                 (6U)
/*! EIRE6 - External Interrupt Request Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define SIUL2_DIRER0_EIRE6(x)                    (((uint32_t)(((uint32_t)(x)) << SIUL2_DIRER0_EIRE6_SHIFT)) & SIUL2_DIRER0_EIRE6_MASK)

