zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_SIUL2.h
/*! @name MIDR4 - SIUL2 MCU ID Register #4 */
/*! @{ */

#define SIUL2_MIDR4_CORE_PLAT_FET_MASK           (0x7U)
#define SIUL2_MIDR4_CORE_PLAT_FET_SHIFT          (0U)
/*! CORE_PLAT_FET - Core Platform Options Feature
 *  0b000..Single core
 *  0b001..Dual core
 *  0b010..1x lock-step core
 *  0b011..1x lock-step core + 1 perf. core
 *  0b100..Triple core
 */
#define SIUL2_MIDR4_CORE_PLAT_FET(x)             (((uint32_t)(((uint32_t)(x)) << SIUL2_MIDR4_CORE_PLAT_FET_SHIFT)) & SIUL2_MIDR4_CORE_PLAT_FET_MASK)

#define SIUL2_MIDR4_EMAC_FET_MASK                (0x18U)
#define SIUL2_MIDR4_EMAC_FET_SHIFT               (3U)
/*! EMAC_FET - Ethernet Feature
 *  0b00..No Ethernet
 *  0b01..Ethernet present
 */
#define SIUL2_MIDR4_EMAC_FET(x)                  (((uint32_t)(((uint32_t)(x)) << SIUL2_MIDR4_EMAC_FET_SHIFT)) & SIUL2_MIDR4_EMAC_FET_MASK)

#define SIUL2_MIDR4_SEC_FET_MASK                 (0x60U)
#define SIUL2_MIDR4_SEC_FET_SHIFT                (5U)
/*! SEC_FET - Security Feature
 *  0b01..HSE-B
 */
#define SIUL2_MIDR4_SEC_FET(x)                   (((uint32_t)(((uint32_t)(x)) << SIUL2_MIDR4_SEC_FET_SHIFT)) & SIUL2_MIDR4_SEC_FET_MASK)
/*! @} */

/*! @name MSCR - SIUL2 Multiplexed Signal Configuration Register */
/*! @{ */

#define SIUL2_MSCR_SSS_0_MASK                    (0x1U)
#define SIUL2_MSCR_SSS_0_SHIFT                   (0U)
/*! SSS_0 - Source Signal Select_0 */
#define SIUL2_MSCR_SSS_0(x)                      (((uint32_t)(((uint32_t)(x)) << SIUL2_MSCR_SSS_0_SHIFT)) & SIUL2_MSCR_SSS_0_MASK)

#define SIUL2_MSCR_SSS_1_MASK                    (0x2U)
#define SIUL2_MSCR_SSS_1_SHIFT                   (1U)
/*! SSS_1 - Source Signal Select_1 */
#define SIUL2_MSCR_SSS_1(x)                      (((uint32_t)(((uint32_t)(x)) << SIUL2_MSCR_SSS_1_SHIFT)) & SIUL2_MSCR_SSS_1_MASK)

#define SIUL2_MSCR_SSS_2_MASK                    (0x4U)
#define SIUL2_MSCR_SSS_2_SHIFT                   (2U)
/*! SSS_2 - Source Signal Select_2 */
#define SIUL2_MSCR_SSS_2(x)                      (((uint32_t)(((uint32_t)(x)) << SIUL2_MSCR_SSS_2_SHIFT)) & SIUL2_MSCR_SSS_2_MASK)

#define SIUL2_MSCR_SMC_MASK                      (0x20U)
#define SIUL2_MSCR_SMC_SHIFT                     (5U)
/*! SMC - Safe Mode Control
 *  0b0..Disable (The output buffer returns to its previous state when the chip leaves Safe mode.)
 *  0b1..Don't disable
 */
#define SIUL2_MSCR_SMC(x)                        (((uint32_t)(((uint32_t)(x)) << SIUL2_MSCR_SMC_SHIFT)) & SIUL2_MSCR_SMC_MASK)

#define SIUL2_MSCR_IFE_MASK                      (0x40U)
#define SIUL2_MSCR_IFE_SHIFT                     (6U)
/*! IFE - IFE
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define SIUL2_MSCR_IFE(x)                        (((uint32_t)(((uint32_t)(x)) << SIUL2_MSCR_IFE_SHIFT)) & SIUL2_MSCR_IFE_MASK)

#define SIUL2_MSCR_DSE_MASK                      (0x100U)
#define SIUL2_MSCR_DSE_SHIFT                     (8U)
/*! DSE - DSE
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define SIUL2_MSCR_DSE(x)                        (((uint32_t)(((uint32_t)(x)) << SIUL2_MSCR_DSE_SHIFT)) & SIUL2_MSCR_DSE_MASK)

#define SIUL2_MSCR_PUS_MASK                      (0x800U)
#define SIUL2_MSCR_PUS_SHIFT                     (11U)
/*! PUS - Pull Select
 *  0b0..Pull down
 *  0b1..Pull up
 */
#define SIUL2_MSCR_PUS(x)                        (((uint32_t)(((uint32_t)(x)) << SIUL2_MSCR_PUS_SHIFT)) & SIUL2_MSCR_PUS_MASK)

#define SIUL2_MSCR_PUE_MASK                      (0x2000U)
#define SIUL2_MSCR_PUE_SHIFT                     (13U)
/*! PUE - Pull Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define SIUL2_MSCR_PUE(x)                        (((uint32_t)(((uint32_t)(x)) << SIUL2_MSCR_PUE_SHIFT)) & SIUL2_MSCR_PUE_MASK)

#define SIUL2_MSCR_SRC_MASK                      (0x4000U)
#define SIUL2_MSCR_SRC_SHIFT                     (14U)
/*! SRC - Slew Rate Control
 *  0b0..Fastest setting
 *  0b1..Slowest setting
 */
#define SIUL2_MSCR_SRC(x)                        (((uint32_t)(((uint32_t)(x)) << SIUL2_MSCR_SRC_SHIFT)) & SIUL2_MSCR_SRC_MASK)

#define SIUL2_MSCR_PKE_MASK                      (0x10000U)
#define SIUL2_MSCR_PKE_SHIFT                     (16U)
/*! PKE - Pad keeping enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define SIUL2_MSCR_PKE(x)                        (((uint32_t)(((uint32_t)(x)) << SIUL2_MSCR_PKE_SHIFT)) & SIUL2_MSCR_PKE_MASK)

#define SIUL2_MSCR_INV_MASK                      (0x20000U)
#define SIUL2_MSCR_INV_SHIFT                     (17U)
/*! INV - Invert
 *  0b0..Don't invert
 *  0b1..Invert
 */
#define SIUL2_MSCR_INV(x)                        (((uint32_t)(((uint32_t)(x)) << SIUL2_MSCR_INV_SHIFT)) & SIUL2_MSCR_INV_MASK)

#define SIUL2_MSCR_IBE_MASK                      (0x80000U)
#define SIUL2_MSCR_IBE_SHIFT                     (19U)
/*! IBE - Input Buffer Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define SIUL2_MSCR_IBE(x)                        (((uint32_t)(((uint32_t)(x)) << SIUL2_MSCR_IBE_SHIFT)) & SIUL2_MSCR_IBE_MASK)

#define SIUL2_MSCR_OBE_MASK                      (0x200000U)
#define SIUL2_MSCR_OBE_SHIFT                     (21U)
/*! OBE - GPIO Output Buffer Enable
 *  0b0..Output driver disabled
 *  0b1..Output driver enabled
 */
#define SIUL2_MSCR_OBE(x)                        (((uint32_t)(((uint32_t)(x)) << SIUL2_MSCR_OBE_SHIFT)) & SIUL2_MSCR_OBE_MASK)
/*! @} */

/*! @name IMCR - SIUL2 Input Multiplexed Signal Configuration Register */
/*! @{ */

#define SIUL2_IMCR_SSS_MASK                      (0xFU)
#define SIUL2_IMCR_SSS_SHIFT                     (0U)
/*! SSS - Source Signal Select */
#define SIUL2_IMCR_SSS(x)                        (((uint32_t)(((uint32_t)(x)) << SIUL2_IMCR_SSS_SHIFT)) & SIUL2_IMCR_SSS_MASK)
/*! @} */

/*! @name GPDO - SIUL2 GPIO Pad Data Output Register */
/*! @{ */

#define SIUL2_GPDO_PDO_n_MASK                    (0x1U)
#define SIUL2_GPDO_PDO_n_SHIFT                   (0U)
/*! PDO_n - Pad Data Out
 *  0b0..Pad Data Out Low
 *  0b1..Pad Data Out High
 */
#define SIUL2_GPDO_PDO_n(x)                      (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO_PDO_n_SHIFT)) & SIUL2_GPDO_PDO_n_MASK)
/*! @} */

/*! @name GPDI - SIUL2 GPIO Pad Data Input Register */
/*! @{ */

#define SIUL2_GPDI_PDI_n_MASK                    (0x1U)
#define SIUL2_GPDI_PDI_n_SHIFT                   (0U)
/*! PDI_n - Pad Data In
 *  0b0..Pad Data In Low
 *  0b1..Pad Data In High
 */
#define SIUL2_GPDI_PDI_n(x)                      (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI_PDI_n_SHIFT)) & SIUL2_GPDI_PDI_n_MASK)
/*! @} */

/*! @name PGPDO - SIUL2 Parallel GPIO Pad Data Out Register */
/*! @{ */

#define SIUL2_PGPDO_PPDO0_MASK                   (0x1U)
#define SIUL2_PGPDO_PPDO0_SHIFT                  (0U)
/*! PPDO0 - Parallel Pad Data Out 0 */
#define SIUL2_PGPDO_PPDO0(x)                     (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDO_PPDO0_SHIFT)) & SIUL2_PGPDO_PPDO0_MASK)

#define SIUL2_PGPDO_PPDO1_MASK                   (0x2U)
#define SIUL2_PGPDO_PPDO1_SHIFT                  (1U)
/*! PPDO1 - Parallel Pad Data Out 1 */
#define SIUL2_PGPDO_PPDO1(x)                     (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDO_PPDO1_SHIFT)) & SIUL2_PGPDO_PPDO1_MASK)

