zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_SIUL2.h
#define SIUL2_PGPDO_PPDO2_MASK                   (0x4U)
#define SIUL2_PGPDO_PPDO2_SHIFT                  (2U)
/*! PPDO2 - Parallel Pad Data Out 2 */
#define SIUL2_PGPDO_PPDO2(x)                     (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDO_PPDO2_SHIFT)) & SIUL2_PGPDO_PPDO2_MASK)

#define SIUL2_PGPDO_PPDO3_MASK                   (0x8U)
#define SIUL2_PGPDO_PPDO3_SHIFT                  (3U)
/*! PPDO3 - Parallel Pad Data Out 3 */
#define SIUL2_PGPDO_PPDO3(x)                     (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDO_PPDO3_SHIFT)) & SIUL2_PGPDO_PPDO3_MASK)

#define SIUL2_PGPDO_PPDO4_MASK                   (0x10U)
#define SIUL2_PGPDO_PPDO4_SHIFT                  (4U)
/*! PPDO4 - Parallel Pad Data Out 4 */
#define SIUL2_PGPDO_PPDO4(x)                     (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDO_PPDO4_SHIFT)) & SIUL2_PGPDO_PPDO4_MASK)

#define SIUL2_PGPDO_PPDO5_MASK                   (0x20U)
#define SIUL2_PGPDO_PPDO5_SHIFT                  (5U)
/*! PPDO5 - Parallel Pad Data Out 5 */
#define SIUL2_PGPDO_PPDO5(x)                     (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDO_PPDO5_SHIFT)) & SIUL2_PGPDO_PPDO5_MASK)

#define SIUL2_PGPDO_PPDO6_MASK                   (0x40U)
#define SIUL2_PGPDO_PPDO6_SHIFT                  (6U)
/*! PPDO6 - Parallel Pad Data Out 6 */
#define SIUL2_PGPDO_PPDO6(x)                     (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDO_PPDO6_SHIFT)) & SIUL2_PGPDO_PPDO6_MASK)

#define SIUL2_PGPDO_PPDO7_MASK                   (0x80U)
#define SIUL2_PGPDO_PPDO7_SHIFT                  (7U)
/*! PPDO7 - Parallel Pad Data Out 7 */
#define SIUL2_PGPDO_PPDO7(x)                     (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDO_PPDO7_SHIFT)) & SIUL2_PGPDO_PPDO7_MASK)

#define SIUL2_PGPDO_PPDO8_MASK                   (0x100U)
#define SIUL2_PGPDO_PPDO8_SHIFT                  (8U)
/*! PPDO8 - Parallel Pad Data Out 8 */
#define SIUL2_PGPDO_PPDO8(x)                     (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDO_PPDO8_SHIFT)) & SIUL2_PGPDO_PPDO8_MASK)

#define SIUL2_PGPDO_PPDO9_MASK                   (0x200U)
#define SIUL2_PGPDO_PPDO9_SHIFT                  (9U)
/*! PPDO9 - Parallel Pad Data Out 9 */
#define SIUL2_PGPDO_PPDO9(x)                     (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDO_PPDO9_SHIFT)) & SIUL2_PGPDO_PPDO9_MASK)

#define SIUL2_PGPDO_PPDO10_MASK                  (0x400U)
#define SIUL2_PGPDO_PPDO10_SHIFT                 (10U)
/*! PPDO10 - Parallel Pad Data Out 10 */
#define SIUL2_PGPDO_PPDO10(x)                    (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDO_PPDO10_SHIFT)) & SIUL2_PGPDO_PPDO10_MASK)

#define SIUL2_PGPDO_PPDO11_MASK                  (0x800U)
#define SIUL2_PGPDO_PPDO11_SHIFT                 (11U)
/*! PPDO11 - Parallel Pad Data Out 11 */
#define SIUL2_PGPDO_PPDO11(x)                    (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDO_PPDO11_SHIFT)) & SIUL2_PGPDO_PPDO11_MASK)

#define SIUL2_PGPDO_PPDO12_MASK                  (0x1000U)
#define SIUL2_PGPDO_PPDO12_SHIFT                 (12U)
/*! PPDO12 - Parallel Pad Data Out 12 */
#define SIUL2_PGPDO_PPDO12(x)                    (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDO_PPDO12_SHIFT)) & SIUL2_PGPDO_PPDO12_MASK)

#define SIUL2_PGPDO_PPDO13_MASK                  (0x2000U)
#define SIUL2_PGPDO_PPDO13_SHIFT                 (13U)
/*! PPDO13 - Parallel Pad Data Out 13 */
#define SIUL2_PGPDO_PPDO13(x)                    (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDO_PPDO13_SHIFT)) & SIUL2_PGPDO_PPDO13_MASK)

#define SIUL2_PGPDO_PPDO14_MASK                  (0x4000U)
#define SIUL2_PGPDO_PPDO14_SHIFT                 (14U)
/*! PPDO14 - Parallel Pad Data Out 14 */
#define SIUL2_PGPDO_PPDO14(x)                    (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDO_PPDO14_SHIFT)) & SIUL2_PGPDO_PPDO14_MASK)

#define SIUL2_PGPDO_PPDO15_MASK                  (0x8000U)
#define SIUL2_PGPDO_PPDO15_SHIFT                 (15U)
/*! PPDO15 - Parallel Pad Data Out 15 */
#define SIUL2_PGPDO_PPDO15(x)                    (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDO_PPDO15_SHIFT)) & SIUL2_PGPDO_PPDO15_MASK)
/*! @} */

/*! @name PGPDI - SIUL2 Parallel GPIO Pad Data In Register */
/*! @{ */

#define SIUL2_PGPDI_PPDI0_MASK                   (0x1U)
#define SIUL2_PGPDI_PPDI0_SHIFT                  (0U)
/*! PPDI0 - Parallel Pad Data In 0 */
#define SIUL2_PGPDI_PPDI0(x)                     (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDI_PPDI0_SHIFT)) & SIUL2_PGPDI_PPDI0_MASK)

#define SIUL2_PGPDI_PPDI1_MASK                   (0x2U)
#define SIUL2_PGPDI_PPDI1_SHIFT                  (1U)
/*! PPDI1 - Parallel Pad Data In 1 */
#define SIUL2_PGPDI_PPDI1(x)                     (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDI_PPDI1_SHIFT)) & SIUL2_PGPDI_PPDI1_MASK)

#define SIUL2_PGPDI_PPDI2_MASK                   (0x4U)
#define SIUL2_PGPDI_PPDI2_SHIFT                  (2U)
/*! PPDI2 - Parallel Pad Data In 2 */
#define SIUL2_PGPDI_PPDI2(x)                     (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDI_PPDI2_SHIFT)) & SIUL2_PGPDI_PPDI2_MASK)

#define SIUL2_PGPDI_PPDI3_MASK                   (0x8U)
#define SIUL2_PGPDI_PPDI3_SHIFT                  (3U)
/*! PPDI3 - Parallel Pad Data In 3 */
#define SIUL2_PGPDI_PPDI3(x)                     (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDI_PPDI3_SHIFT)) & SIUL2_PGPDI_PPDI3_MASK)

#define SIUL2_PGPDI_PPDI4_MASK                   (0x10U)
#define SIUL2_PGPDI_PPDI4_SHIFT                  (4U)
/*! PPDI4 - Parallel Pad Data In 4 */
#define SIUL2_PGPDI_PPDI4(x)                     (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDI_PPDI4_SHIFT)) & SIUL2_PGPDI_PPDI4_MASK)

#define SIUL2_PGPDI_PPDI5_MASK                   (0x20U)
#define SIUL2_PGPDI_PPDI5_SHIFT                  (5U)
/*! PPDI5 - Parallel Pad Data In 5 */
#define SIUL2_PGPDI_PPDI5(x)                     (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDI_PPDI5_SHIFT)) & SIUL2_PGPDI_PPDI5_MASK)

#define SIUL2_PGPDI_PPDI6_MASK                   (0x40U)
#define SIUL2_PGPDI_PPDI6_SHIFT                  (6U)
/*! PPDI6 - Parallel Pad Data In 6 */
#define SIUL2_PGPDI_PPDI6(x)                     (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDI_PPDI6_SHIFT)) & SIUL2_PGPDI_PPDI6_MASK)

