zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_SIUL2.h
#define SIUL2_PGPDI_PPDI7_MASK                   (0x80U)
#define SIUL2_PGPDI_PPDI7_SHIFT                  (7U)
/*! PPDI7 - Parallel Pad Data In 7 */
#define SIUL2_PGPDI_PPDI7(x)                     (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDI_PPDI7_SHIFT)) & SIUL2_PGPDI_PPDI7_MASK)

#define SIUL2_PGPDI_PPDI8_MASK                   (0x100U)
#define SIUL2_PGPDI_PPDI8_SHIFT                  (8U)
/*! PPDI8 - Parallel Pad Data In 8 */
#define SIUL2_PGPDI_PPDI8(x)                     (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDI_PPDI8_SHIFT)) & SIUL2_PGPDI_PPDI8_MASK)

#define SIUL2_PGPDI_PPDI9_MASK                   (0x200U)
#define SIUL2_PGPDI_PPDI9_SHIFT                  (9U)
/*! PPDI9 - Parallel Pad Data In 9 */
#define SIUL2_PGPDI_PPDI9(x)                     (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDI_PPDI9_SHIFT)) & SIUL2_PGPDI_PPDI9_MASK)

#define SIUL2_PGPDI_PPDI10_MASK                  (0x400U)
#define SIUL2_PGPDI_PPDI10_SHIFT                 (10U)
/*! PPDI10 - Parallel Pad Data In 10 */
#define SIUL2_PGPDI_PPDI10(x)                    (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDI_PPDI10_SHIFT)) & SIUL2_PGPDI_PPDI10_MASK)

#define SIUL2_PGPDI_PPDI11_MASK                  (0x800U)
#define SIUL2_PGPDI_PPDI11_SHIFT                 (11U)
/*! PPDI11 - Parallel Pad Data In 11 */
#define SIUL2_PGPDI_PPDI11(x)                    (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDI_PPDI11_SHIFT)) & SIUL2_PGPDI_PPDI11_MASK)

#define SIUL2_PGPDI_PPDI12_MASK                  (0x1000U)
#define SIUL2_PGPDI_PPDI12_SHIFT                 (12U)
/*! PPDI12 - Parallel Pad Data In 12 */
#define SIUL2_PGPDI_PPDI12(x)                    (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDI_PPDI12_SHIFT)) & SIUL2_PGPDI_PPDI12_MASK)

#define SIUL2_PGPDI_PPDI13_MASK                  (0x2000U)
#define SIUL2_PGPDI_PPDI13_SHIFT                 (13U)
/*! PPDI13 - Parallel Pad Data In 13 */
#define SIUL2_PGPDI_PPDI13(x)                    (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDI_PPDI13_SHIFT)) & SIUL2_PGPDI_PPDI13_MASK)

#define SIUL2_PGPDI_PPDI14_MASK                  (0x4000U)
#define SIUL2_PGPDI_PPDI14_SHIFT                 (14U)
/*! PPDI14 - Parallel Pad Data In 14 */
#define SIUL2_PGPDI_PPDI14(x)                    (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDI_PPDI14_SHIFT)) & SIUL2_PGPDI_PPDI14_MASK)

#define SIUL2_PGPDI_PPDI15_MASK                  (0x8000U)
#define SIUL2_PGPDI_PPDI15_SHIFT                 (15U)
/*! PPDI15 - Parallel Pad Data In 15 */
#define SIUL2_PGPDI_PPDI15(x)                    (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDI_PPDI15_SHIFT)) & SIUL2_PGPDI_PPDI15_MASK)
/*! @} */

/*! @name MPGPDO - SIUL2 Masked Parallel GPIO Pad Data Out Register */
/*! @{ */

#define SIUL2_MPGPDO_MPPDO0_MASK                 (0x1U)
#define SIUL2_MPGPDO_MPPDO0_SHIFT                (0U)
/*! MPPDO0 - Masked Parallel Pad Data Out 0 */
#define SIUL2_MPGPDO_MPPDO0(x)                   (((uint32_t)(((uint32_t)(x)) << SIUL2_MPGPDO_MPPDO0_SHIFT)) & SIUL2_MPGPDO_MPPDO0_MASK)

#define SIUL2_MPGPDO_MPPDO1_MASK                 (0x2U)
#define SIUL2_MPGPDO_MPPDO1_SHIFT                (1U)
/*! MPPDO1 - Masked Parallel Pad Data Out 1 */
#define SIUL2_MPGPDO_MPPDO1(x)                   (((uint32_t)(((uint32_t)(x)) << SIUL2_MPGPDO_MPPDO1_SHIFT)) & SIUL2_MPGPDO_MPPDO1_MASK)

#define SIUL2_MPGPDO_MPPDO2_MASK                 (0x4U)
#define SIUL2_MPGPDO_MPPDO2_SHIFT                (2U)
/*! MPPDO2 - Masked Parallel Pad Data Out 2 */
#define SIUL2_MPGPDO_MPPDO2(x)                   (((uint32_t)(((uint32_t)(x)) << SIUL2_MPGPDO_MPPDO2_SHIFT)) & SIUL2_MPGPDO_MPPDO2_MASK)

#define SIUL2_MPGPDO_MPPDO3_MASK                 (0x8U)
#define SIUL2_MPGPDO_MPPDO3_SHIFT                (3U)
/*! MPPDO3 - Masked Parallel Pad Data Out 3 */
#define SIUL2_MPGPDO_MPPDO3(x)                   (((uint32_t)(((uint32_t)(x)) << SIUL2_MPGPDO_MPPDO3_SHIFT)) & SIUL2_MPGPDO_MPPDO3_MASK)

#define SIUL2_MPGPDO_MPPDO4_MASK                 (0x10U)
#define SIUL2_MPGPDO_MPPDO4_SHIFT                (4U)
/*! MPPDO4 - Masked Parallel Pad Data Out 4 */
#define SIUL2_MPGPDO_MPPDO4(x)                   (((uint32_t)(((uint32_t)(x)) << SIUL2_MPGPDO_MPPDO4_SHIFT)) & SIUL2_MPGPDO_MPPDO4_MASK)

#define SIUL2_MPGPDO_MPPDO5_MASK                 (0x20U)
#define SIUL2_MPGPDO_MPPDO5_SHIFT                (5U)
/*! MPPDO5 - Masked Parallel Pad Data Out 5 */
#define SIUL2_MPGPDO_MPPDO5(x)                   (((uint32_t)(((uint32_t)(x)) << SIUL2_MPGPDO_MPPDO5_SHIFT)) & SIUL2_MPGPDO_MPPDO5_MASK)

#define SIUL2_MPGPDO_MPPDO6_MASK                 (0x40U)
#define SIUL2_MPGPDO_MPPDO6_SHIFT                (6U)
/*! MPPDO6 - Masked Parallel Pad Data Out 6 */
#define SIUL2_MPGPDO_MPPDO6(x)                   (((uint32_t)(((uint32_t)(x)) << SIUL2_MPGPDO_MPPDO6_SHIFT)) & SIUL2_MPGPDO_MPPDO6_MASK)

#define SIUL2_MPGPDO_MPPDO7_MASK                 (0x80U)
#define SIUL2_MPGPDO_MPPDO7_SHIFT                (7U)
/*! MPPDO7 - Masked Parallel Pad Data Out 7 */
#define SIUL2_MPGPDO_MPPDO7(x)                   (((uint32_t)(((uint32_t)(x)) << SIUL2_MPGPDO_MPPDO7_SHIFT)) & SIUL2_MPGPDO_MPPDO7_MASK)

#define SIUL2_MPGPDO_MPPDO8_MASK                 (0x100U)
#define SIUL2_MPGPDO_MPPDO8_SHIFT                (8U)
/*! MPPDO8 - Masked Parallel Pad Data Out 8 */
#define SIUL2_MPGPDO_MPPDO8(x)                   (((uint32_t)(((uint32_t)(x)) << SIUL2_MPGPDO_MPPDO8_SHIFT)) & SIUL2_MPGPDO_MPPDO8_MASK)

#define SIUL2_MPGPDO_MPPDO9_MASK                 (0x200U)
#define SIUL2_MPGPDO_MPPDO9_SHIFT                (9U)
/*! MPPDO9 - Masked Parallel Pad Data Out 9 */
#define SIUL2_MPGPDO_MPPDO9(x)                   (((uint32_t)(((uint32_t)(x)) << SIUL2_MPGPDO_MPPDO9_SHIFT)) & SIUL2_MPGPDO_MPPDO9_MASK)

#define SIUL2_MPGPDO_MPPDO10_MASK                (0x400U)
#define SIUL2_MPGPDO_MPPDO10_SHIFT               (10U)
/*! MPPDO10 - Masked Parallel Pad Data Out 10 */
#define SIUL2_MPGPDO_MPPDO10(x)                  (((uint32_t)(((uint32_t)(x)) << SIUL2_MPGPDO_MPPDO10_SHIFT)) & SIUL2_MPGPDO_MPPDO10_MASK)

#define SIUL2_MPGPDO_MPPDO11_MASK                (0x800U)
#define SIUL2_MPGPDO_MPPDO11_SHIFT               (11U)
/*! MPPDO11 - Masked Parallel Pad Data Out 11 */
#define SIUL2_MPGPDO_MPPDO11(x)                  (((uint32_t)(((uint32_t)(x)) << SIUL2_MPGPDO_MPPDO11_SHIFT)) & SIUL2_MPGPDO_MPPDO11_MASK)

